#ifndef TEACHER_H
#define TEACHER_H

#include "person.h"


/*================================================
||                                               ||
||                                               ||
||                                               ||
||                                               ||
||                                               ||
||   ‡„…‘œ Œƒ‹€ › ›’œ ‚€˜€ …Š‹€Œ€,           ||
||      ‹ˆ˜œ ‡€  „ €‹‹› ‡€ ‹€“               ||
||                                               ||
||                                               ||
||                                               ||
||                                               ||
||                                               ||
==================================================*/


Teacher* createTeacher(char* firstName, 
                        char* secondName, 
                        char* lastName,
                       int dayBirth, 
                       int monthBirth, 
                       int yearBirth,
                       Person_ID* id, 
                       int salary);


/*================================================
||                                               ||
||                                               ||
||                                               ||
||                                               ||
||                                               ||
||   ‡„…‘œ Œƒ‹€ › ›’œ ‚€˜€ …Š‹€Œ€,           ||
||      ‹ˆ˜œ ‡€  „ €‹‹› ‡€ ‹€“               ||
||                                               ||
||                                               ||
||                                               ||
||                                               ||
||                                               ||
==================================================*/


#endif